app/controllers/songs_controller.rb

  def index
       @response = Artist.exists?(id: params[:artist_id])

        if @response == false && params.include?(:artist_id)
          flash[:alert] = "Artist not found."
          redirect_to artists_path
        else
          @songs = Song.all
---
SELECT "songs".* FROM "songs"

  def show
    @answer = Song.exists?(id: params[:id])
   if @answer
       @song = Song.find(params[:id])

   else
     flash[:alert] = "Song not found."
     @artist = Artist.find(params[:artist_id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]